{"config": [{"config": {"strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "padding": "valid", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_1", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "padding": "valid", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "noise_shape": null, "rate": 0.25, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "units": 128, "trainable": true, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "noise_shape": null, "rate": 0.75, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "units": 10, "trainable": true, "activation": "softmax", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.0", "backend": "tensorflow"}